app/views/users/index.html.erb

        <td> <%= user.email %> </td>
        <td> <%= user.events.size() %> </td>
---
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]