app/views/users/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
---
<ul>
  <% @user.events.each do |event| %>

SELECT 1 AS one FROM "events" WHERE "events"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---

<% if @user.events.empty? %>