app/views/events/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id, "Assigned user" %>
    <%= form.collection_select :user_id, User.all, :id, :name, prompt: "select a user" %>