app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @events = Event.all

INSERT INTO "events" ("title", "date", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", ""], ["date", "2026-09-27"], ["created_at", "2026-09-27 17:15:33.625911"], ["updated_at", "2026-09-27 17:15:33.625911"], ["user_id", nil]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "title" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "event 2"], ["updated_at", "2026-09-27 17:27:38.228684"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 3]]
---
  def destroy
    @event.destroy

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_event
      @event = Event.find(params[:id])